# RoutingPreferenceManager Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPCurveType..::..RoutingPreferenceManager Property
MEPCurveType Class See Also
---
The RoutingPreferenceManager for the MEPCurveType
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public RoutingPreferenceManager RoutingPreferenceManager { get; }
```

Visual Basic
---
```text
Public ReadOnly Property RoutingPreferenceManager As RoutingPreferenceManager
	Get
```

Visual C++
---
```text
public:
property RoutingPreferenceManager^ RoutingPreferenceManager {
	RoutingPreferenceManager^ get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
MEPCurveType Class
Autodesk.Revit.DB Namespace